Autodesk.Revit.DB.Units.IsModifiableSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether the default FormatOptions can be modified for a given spec.
Remarks:
The Units class stores a FormatOptions object for every spec, but
not all of them can be directly modified. Some have fixed
definitions.
specTypeId:
Identifier of the spec to check.
Returns:
True if the FormatOptions can be modified, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Units.SetFormatOptions(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.FormatOptions)
Sets the default FormatOptions for a spec.
specTypeId:
Identifier of the spec.
options:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
-or-
FormatOptions cannot be modified for specTypeId. See Units.IsModifiableSpec(ForgeTypeId) and Units.GetModifiableSpecs().
-or-
UseDefault is true in options.
-or-
The unit in options is not valid for specTypeId. See UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and UnitUtils.GetValidUnits(ForgeTypeId).
-or-
The rounding method in options is not set to Nearest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Units.SetFormatOptions(Autodesk.Revit.DB.UnitType,Autodesk.Revit.DB.FormatOptions)
Sets the default FormatOptions for a unit type.
Remarks:
Some unit types have definitions which are automatically derived
from other unit types.  For example, UT_SheetLength is derived from
UT_Length and UT_ForceScale is derived from UT_Force.  In such
cases, calling SetFormatOptions() for one unit type may have the
side effect of changing the FormatOptions for other unit types that
depend on it.
unitType:
The unit type.
options:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
FormatOptions cannot be modified for unitType.  See Units.IsModifiableUnitType() and Units.GetModifiableUnitTypes().
-or-
UseDefault is true in options.
-or-
The display unit in options is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
-or-
The rounding method in options is not set to Nearest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.GetFormatOptions(Autodesk.Revit.DB.ForgeTypeId)
Gets the default FormatOptions for a spec.
specTypeId:
Identifier of the spec.
Returns:
A copy of the FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014